tap "encoredev/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "jdx/tap"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
brew "neovim"
# Mac App Store command-line interface
brew "mas"
brew "ripgrep"
# Polyglot tool version manager
brew "mise"
# The static analysis-powered Go framework for building backend applications
brew "encoredev/tap/encore"
brew "jdx/tap/usage"
# GPU-accelerated terminal emulator
cask "alacritty"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka"
cask "font-iosevka-nerd-font"
# Replacement for Docker Desktop
cask "orbstack"
# Control your tools with a few keystrokes
cask "raycast"
# Multiplayer code editor
cask "zed"
mas "1Blocker", id: 1365531024
mas "Balance", id: 1637311725
mas "Craft", id: 1487937127
mas "Fantastical", id: 975937182
mas "Things", id: 904280696
